Revit 2027 API
BasicFileInfo.Username Property
 Returns the username.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Username { get; }
Public ReadOnly Property Username As String
	Get
public:
property String^ Username {
	String^ get ();
}
member Username : string with get
Property Value
String
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace